CSI API ETABS v1
cDStAustralian_AS4100_2020.GetOverwrite Method
 Retrieves the value of a steel design overwrite item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOverwrite(
	string Name,
	int Item,
	ref double Value,
	ref bool ProgDet
)
Function GetOverwrite (
	Name As String,
	Item As Integer,
	ByRef Value As Double,
	ByRef ProgDet As Boolean
) As Integer
Dim instance As cDStAustralian_AS4100_2020
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ProgDet As Boolean
Dim returnValue As Integer
returnValue = instance.GetOverwrite(Name,
	Item, Value, ProgDet)
int GetOverwrite(
	String^ Name,
	int Item,
	double% Value,
	bool% ProgDet
)
abstract GetOverwrite :
        Name : string *
        Item : int *
        Value : float byref *
        ProgDet : bool byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame object with a steel frame design procedure
Item
Type: System.Int32
 This is an integer between 1 and 46, inclusive, indicating the overwrite item considered
Framing type
Steel type
Consider deflection
Deflection check type
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total-camber limit, L/Value
DL deflection limit, absolute
SDL + LL deflection limit, absolute
LL deflection limit, absolute
Total load deflection limit, absolute
Total camber limit, absolute
Specified camber
Net area to total area ratio
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Unbraced length ratio, Lateral Torsional Buckling
Effective length factor, Ke Major Braced
Effective length factor, Ke Minor Braced
Effective length factor, Ke Major Sway
Effective length factor, Ke Minor Sway
Twist restraint factor for LTB (kt)
Lateral rotation restraint factor (kr)
Load height factor for LTB (kl)
Moment coefficient, Cm Major
Moment coefficient, Cm Minor
Moment modification factor, Alpha_m
Slender reduction factor, Alpha_s
Nonsway moment factor, Db Major
Nonsway moment factor, Db Minor
Sway moment factor, Ds Major
Sway moment factor, Ds Minor
Form factor, Kf
Axial capacity correction factor, Kt
Yield stress, Fy
Compressive capacity, Nc
Tensile capacity, Nt
Major bending capacity, Ms33
Minor bending capacity, Ms22
Major bending capacity, Mb33
Major shear capacity, Vu2
Minor shear capacity, Vu3
Demand/capacity ratio limit
Value
Type: System.Double
 The value of the considered overwrite item
Framing type
0 - As specified in preferences
1 - Moment frame
2 - Braced frame
Steel type
1 - Hot rolled
2 - Hot finished
3 - Cold form
4 - Stress relieved
5 - Lightly welded
6 - Heavily welded
Consider deflection?
0 = No
Any other value = Yes
Deflection check type
0 - Program Determined
1 - Ratio
2 - Absolute
3 - Both
DL deflection limit, L/Value
Value >= 0; 0 means no check for this item
SDL + LL deflection limit, L/Value
Value >= 0; 0 means no check for this item
LL deflection limit, L/Value
Value >= 0; 0 means no check for this item
Total load deflection limit, L/Value
Value >= 0; 0 means no check for this item
Total-camber limit, L/Value
Value >= 0; 0 means no check for this item
DL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
SDL + LL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
LL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
Total load deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
Total-camber limit, absolute
Value >= 0; 0 means no check for this item. [L]
Specified camber
Value >= 0. [L]
Net area to total area ratio
Value >= 0; 0 means use program default value
Live load reduction factor
Value >= 0; 0 means use program determined value
Unbraced length ratio, Major
Value >= 0; 0 means use program determined value
Unbraced length ratio, Minor
Value >= 0; 0 means use program determined value
Unbraced length ratio, Lateral Torsional Buckling
Value >= 0; 0 means use program determined value
Effective length factor, Ke Major Braced
Value >= 0; 0 means use program determined value
Effective length factor, Ke Minor Braced
Value >= 0; 0 means use program determined value
Effective length factor, Ke Major Sway
Value >= 0; 0 means use program determined value
Effective length factor, Ke Minor Sway
Value >= 0; 0 means use program determined value
Twist restraint factor for LTB (kt)
 Value >= 0; 0 means use program determined value
Lateral rotation restraint factor (kr)
 Value >= 0; 0 means use program determined value
Load height factor for LTB (kl)
 Value >= 0; 0 means use program determined value
Moment coefficient, Cm Major
Value >= 0; 0 means use program determined value
Moment coefficient, Cm Minor
Value >= 0; 0 means use program determined value
Moment modification factor, Alpha_m
Value >= 0; 0 means use program determined value
Slender reduction factor, Alpha_s
 Value >= 0; 0 means use program determined value
Nonsway moment factor, Db Major
Value >= 0; 0 means use program determined value
Nonsway moment factor, Db Minor
Value >= 0; 0 means use program determined value
Sway moment factor, Bs Major
Value >= 0; 0 means use program determined value
Sway moment factor, Bs Minor
Value >= 0; 0 means use program determined value
Form factor, Kf
Value >= 0; 0 means use program determined value
Axial capacity correction factor, Kt
Value >= 0; 0 means use program determined value
Yield stress, Fy
Value >= 0; 0 means use program determined value [F/L2]
Compressive capacity, Nc
 Value >= 0; 0 means use program determined value [F]
Tensile capacity, Nt
Value >= 0; 0 means use program determined value [F]
Major bending capacity, Ms33
 Value >= 0; 0 means use program determined value [FL]
Minor bending capacity, Ms22
Value >= 0; 0 means use program determined value [FL]
Minor bending capacity, Mb33
Value >= 0; 0 means use program determined value [FL]
Major shear capacity, Vu2
Value >= 0; 0 means use program determined value [F]
Minor shear capacity, Vu3
Value >= 0; 0 means use program determined value [F]
Demand/capacity ratio limit
Value >= 0; 0 means use program determined value
ProgDet
Type: System.Boolean
 If this item is True, the specified value is program determined
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("AS 4100:2020")
'get overwrite item
   ret = SapModel.DesignSteel.Australian_AS4100_2020.GetOverwrite("8", 1, Value, ProgDet)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStAustralian_AS4100_2020 Interface
ETABSv1 Namespace